cask_args appdir: '/Applications'

tap "atlassian/tap"
tap "caskroom/cask"
tap "grammarly/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"

## Basic Dev tools
brew "git"
brew "gnu-tar"
brew "gnupg"
brew "gpg-agent"
brew "vim"
brew "wget"

## Languages
brew "python3"
brew "ruby"
brew "perl"
brew 'go'

## Config and deployment tools
brew "ansible"

## Hashi tools
cask "vagrant"
brew "packer"
brew "terragrunt"

## Applications
cask 'virtualbox'
cask 'slack'
cask 'atom'
cask 'google-chrome'


# Misc
brew "libyaml"
brew "openssl@1.1"
brew "openssl"
brew "artifactory-cli-go"
brew "autoconf"
brew "automake"
brew "gmp@4"
brew "csshx"
brew "libassuan"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "jpeg"
brew "mpfr@2"
brew "libmpc@0.8"
brew "gcc@4.9"
brew "libtool"
brew "graphviz"
brew "isl@0.11"
brew "libevent"
brew "libusb-compat"
brew "makedepend"
brew "pkg-config"
brew "rename"
brew "scons"
brew "tmux"
brew "utf8proc"
